artillery.yml
config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 10
      arrivalRate: 5
  plugins:
    expect: {}
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Get Posts and Validate"
    flow:
      - get:
          url: "/posts/1"
          expect:
            - statusCode: 200